app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "I pry with my little eye"], ["room_number", 0], ["created_at", "2018-12-23 14:20:51.088002"], ["updated_at", "2018-12-23 14:20:51.088002"]]
---
    def create
      @school_class = SchoolClass.create(school_params)

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-01-02 13:33:58.299441"], ["id", 1]]
---
    def update
      @school_class.update(school_params)